geigerf/STAG_Complete_lowPower/STAG_Complete_lowPower.ioc
Mcu.Pin23=VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_5.0.0
Mcu.Pin20=VP_SYS_VS_Systick
ADC1.master=1
Mcu.Pin21=VP_TIM6_VS_ClockSourceINT
PJ0.GPIOParameters=GPIO_Label
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:true\:false
PJ5.Signal=GPIO_Output
ProjectManager.CompilerOptimize=6
ADC1.Rank-1\#ChannelRegularConversion=2
PJ4.Locked=true
PJ0.GPIO_Label=Dmux_sel0
ProjectManager.HeapSize=0x2000
Mcu.Pin15=PA6
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:true\:false
Mcu.Pin16=PH6
PF6.GPIOParameters=GPIO_Label
Mcu.Pin13=PA4
PC6.GPIOParameters=GPIO_Label
Mcu.Pin14=PJ3
PH6.Signal=GPIO_Output
Mcu.Pin19=VP_CRC_VS_CRC
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PJ0
RCC.HSI_VALUE=16000000
Mcu.Pin18=PJ1
PCC.Seq0.Step1.Frequency=0 Hz
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjApplication_5.0.0.Mode=ArtificialOoIntelligenceJjApplication
RCC.PLLQ=4
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_3
ADC1.NbrOfConversionFlag=1
Mcu.Pin11=PJ5
Mcu.Pin12=PA0/WKUP
RCC.PLLM=8
STMicroelectronics.X-CUBE-AI.5.0.0.ModelHashList=4a777269b15ae735e5917de376a15997c86f35e3944f2cdbd16dda3ebaa704af
PB8.Mode=I2C
RCC.PLLN=216
Mcu.Pin10=PJ4
PCC.Seq0.Step1.Peripherals=
PB8.Signal=I2C1_SCL
PC8.Locked=true
STMicroelectronics.X-CUBE-AI.5.0.0.NNModelInformation_ModelName-4a777269b15ae735e5917de376a15997c86f35e3944f2cdbd16dda3ebaa704af=network
PCC.Seq0.Step1.Vcore=No Scale
CORTEX_M7.CPU_DCache=Enabled
PCC.Seq0.Step1.Voltage_Source=Battery
PCC.Seq0.Step0.Vdd=3.3
PCC.Seq0=2
RCC.I2C2Freq_Value=54000000
RCC.APB1Freq_Value=54000000
RCC.SDMMC2Freq_Value=216000000
VP_CRC_VS_CRC.Mode=CRC_Activate
ProjectManager.DeviceId=STM32F769NIHx
ProjectManager.LibraryCopy=0
PJ13.Signal=GPIO_Output
STMicroelectronics.X-CUBE-AI.5.0.0.ModelNameList=network
PA6.Locked=true
